<?/*

https://www.youtube.com/watch?v=XzLuMtDelGk&ab_channel=UlbiTV


Vue3  https://v3.ru.vuejs.org/

Для рендеринга Vue под капотом строит виртуальное дерево Virtual Dom.
После сравнивает Dom-дерево и Virtual Dom, и всей пачкой отдает Dom-дереву.

Компонентный подход.
Компонент - переиспольуемые куски кода.
Имеется корневой узел-компонент, в него подключаются другие компоненты.

Реактивность.
Здесь мы сосредотачиваемся на логике работы с данными. не описывая вывод, отображение кодом.




Установка
npm install -g @vue/cli
vue create . (.-текущая папка, можно указать project_name папку) - с помощью мастера создаем проект
npm run serve - запуск в режиме разработки




Компонент
vbase - короткая запись  для компонента
